Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadial Properties
The CurvedDimensionSetRadial type exposes the following members.
Properties
Name | Description
ArcPoint1
 Gets the first arc point.
 (Inherited from CurvedDimensionSetBase.)
ArcPoint2
 Gets the second arc point.
 (Inherited from CurvedDimensionSetBase.)
ArcPoint3
 Gets the third arc point.
 (Inherited from CurvedDimensionSetBase.)
Attributes
 The curved dimension set radial attributes.
DimensionPoints
 Gets a list of the dimension points.
 (Inherited from CurvedDimensionSetBase.)
Distance
 Gets the distance. The distance is measured in paper millimeters.
 (Inherited from CurvedDimensionSetBase.)
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from DimensionSetBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
CurvedDimensionSetRadial Class
Tekla.Structures.Drawing Namespace